[
  {
    "id": "company_2025-09-09",
    "type": "company",
    "date": "2025-09-09T19:00:00.000Z",
    "title": "Meet .robot — The TLD for Builders, Dreamers, and Bots",
    "shortMessage": "The .robot pre-sale is live now, with minting beginning on 0G blockchain in Q1 2026.",
    "fullMessage": "Robots are everywhere: from drones and NPCs to automated workflows and AI agents. They live in hardware, in code, and in culture. It's a world that deserves its own identity. Enter .robot, our latest Web3-only TLD.\\n\\nBuilt with 0G Foundation, .robot is the naming layer for the robotics spectrum — from cobots and automation to humanoids and gaming bots. The future is accelerating fast: cobots growing 32% YoY by 2030, AI making robots smarter by 2025, and experts predicting humanoids will soon reshape logistics and manufacturing.\\n\\n.robot works for:\\n\\n🤖 Robotics startups & labs\\n🛠️ AI agents & tools\\n🎮 Gaming characters & bots\\n📦 Automation platforms\\n👾 Fun, personal projects\\n\\nThe best .robot names won't last. Secure high-potential domains before they're gone:\\n\\n    helper.robot\\n    dev.robot\\n    gamer.robot\\n    ai.robot\\n    delivery.robot\\n\\nThe .robot pre-sale is live now, with minting beginning on 0G blockchain in Q1 2026."
  },
  {
    "id": "company_2024-09-08",
    "type": "company",
    "date": "2024-09-08T16:00:00.000Z",
    "title": "Coming Soon — Voices of Power",
    "shortMessage": "The conversations that shape society are happening online, in real time, and increasingly onchain",
    "fullMessage": "Policy debates, finance reforms, civic movements. The conversations that shape society don't just happen in hearing rooms anymore. They're happening online, in real time, and increasingly onchain.\n\nThat's why we're launching The Civic Collection, a limited drop of premium domains releasing September 15th at 9 AM ET. This drop launches alongside The Future of Money, Governance, and the Law, the Government Blockchain Association's flagship Capitol Hill event with Edge Of as sponsor. It captures the language of money, governance, and law in Web3.\n\nA few names you'll see:\n\n    vote.collect\n    law.hub\n    city.austin\n    data.wifi\n    news.podcast\n\nDrop Details\n\n    Begins: September 15th, 9 AM ET\n    Ends: September 22nd, 9 AM ET, or when all domains are sold.\n    Availability: First-come, first-served\n\nThe next chapter of governance is being written. Secure your place in the conversation."
  }
]
